[
  {
    "path": "posts/2022-02-20-blue-forest-fieldtrip/",
    "title": "Group Project fieldtrip to Tahoe-Central Sierra region",
    "description": "A brief visit to our GP project site",
    "author": [
      {
        "name": "Brendan McGovern",
        "url": {}
      }
    ],
    "date": "2022-02-20",
    "categories": [],
    "contents": "\nThis December, my Group Project team and I had the opportunity to visit the our Group Project study region, the Tahoe-Central Sierra. We meet our client, Blue Forest Conservation in Bullard’s Bar Reservoir and toured a number of sites in the Yuba Watershed to discuss various project sites, wildfire impacts, restoration goals and the resevoir itself!\nBullards Bar ReservoirAfter discussing sedimentation and woody debris impacts to reservoir operations, we toured the Pendola Fire burn area where active restoration was taking place to reduce erosion and sediment into the reservoir.\nPendola Fire siteOn our second day, we meet with the general manager at Sierra Pacific Industries, where we toured their lumber mill and cogeneration facility. We learned about operations, discussed the impacts of wildfire risk to operations and toured the facility.\nSierra Pacific Industries tour\n\n\n",
    "preview": {},
    "last_modified": "2022-02-22T08:27:46-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-20-jmt/",
    "title": "JMT",
    "description": "Hiking the most beautiful mountains in the country",
    "author": [
      {
        "name": "Brendan McGovern",
        "url": {}
      }
    ],
    "date": "2022-02-20",
    "categories": [],
    "contents": "\nMuir HutIn the summer of 2019, I had the opportunity to hike the John Muir Trail from south to north. Typically, folks prefer to start in Yosemite Valley and head south, but permits were pretty competitive so we opted to start just south of Mount Whitney and head north. The Sierra got some unusual late snow at the end of May, which set us up for a more challenging hike. It complicated our itinerary a bit, but was an incredible experience that I wouldn’t trade for anything.\nStunning Views\n\n\n",
    "preview": {},
    "last_modified": "2022-02-22T08:27:46-08:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-02-05-welcome/",
    "title": "Welcome",
    "description": "Welcome to my website.",
    "author": [
      {
        "name": "Brendan McGovern",
        "url": {}
      }
    ],
    "date": "2022-02-05",
    "categories": [],
    "contents": "\nWelcome to my blog. I will provide my musings on water, climate and management decisions on a relatively frequent basis.\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-25T09:06:15-08:00",
    "input_file": {}
  }
]
