[
  {
    "path": "research_portfolio/2022-02-25-coding-project/",
    "title": "Binary Logistic Regression: Florida Palmetto Species",
    "description": "In this project, I examined Florida palmetto data through exploratory visaulizations and used binary logistic regression to classify palmetto species.",
    "author": [
      {
        "name": "Brendan McGovern",
        "url": {}
      }
    ],
    "date": "2022-02-25",
    "categories": [],
    "contents": "\nFlorida Palmetto Species\nThis anaylsis will utilize data from Abrahamson, 2019, on Florida palmetto characteristics. We will use binary logistic regression to test feasibility of using variables plant height, canopy length, canopy width, and number of green leaves to classify whether a palmetto is Serenoa repens or Sabal etonia.\nExploratory Data Visualization\nFrom our exploratory analysis of the variables, we can see that the number of green leaves seems to have the greatest impact on determining the difference between the species from the variables we have analyzed. Height, width and length do not produce noticeable differences between species.\n\nFIGURE 3: Of the variables of interest in this analysis the count of green leaves appears to be a decent determinant of distinguishing palmetto species Sabal etonia (red) and Serenoa repens (blue) from each other (Data: Abrahamson, 2019).Binary Logistic Regression Analysis\nBased on these plots the number of green leaves are more likely to help classify species correctly, but to be sure we will perform a binary logistic regression to determine the probability of a plant being either Serenoa repens or Sabal etonia based on these predictor variables.\nModel Selection\nWe are interested in performing a binary logistic regression to determine the probability of a plant being either Serenoa repens or Sabal etonia based on several predictor variables. This will help me compare the two models and determine which one might better predict a plant to be Serenoa repens or Sabal etonia.\nModel 1: Log odds of plant type using plant height, canopy length, canopy width and green leaves as predictor variables\nModel 2: Log odds of plant type using plant height, canopy width, and green leaves.\nUsing AIC to compare the two models, it appears that Model 1 is a superior model. Model 2 receives a AIC_c value of 792.91 when compared to Model 1. However, we conducted a ten-fold cross validation, repeated 20 times, Model 1 still appears to be a better model at predicting plant species. Model 1 has an accuracy of 0.916 and Model 2 has an accuracy of 0.898.\nCitation\nData source: Abrahamson, W.G. 2019. Survival, growth and biomass estimates of two dominant palmetto species of south-central Florida from 1981 - 2017, ongoing at 5-year intervals ver 1. Environmental Data Initiative. https://doi.org/10.6073/pasta/f2f96ec76fbbd4b9db431c79a770c4d5\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-25T09:03:48-08:00",
    "input_file": {}
  },
  {
    "path": "research_portfolio/2022-02-25-hares/",
    "title": "Bonanza Creek LTER Snowshoe Hare Weight Analysis",
    "description": "This analysis looks at differences in snowshoe hare weights between male and female sexes at three different monitoring sites within the Bonanza Creek U.S. Long Term Ecological Research Network in Interior Alaska from 1999 - 2012.",
    "author": [
      {
        "name": "Brendan McGovern",
        "url": {}
      }
    ],
    "date": "2022-02-25",
    "categories": [],
    "contents": "\n\n\n\n\n\n\n\n\n\nIntroduction\nThis report provides an exploratory overview of differences in snowshoe hare weights between male and female sexes at three different monitoring sites within the Bonanza Creek U.S. Long Term Ecological Research Network in Interior Alaska from 1999 - 2012 (Kielland et al. 2017). Specifically, weight is compared between sex, and the relationship between weight and hind foot length are explored.\nData and analyses\nSnowshoe hare measurements were collected and made available by Dr. Knut Kielland and colleagues at the Bonanza Creek LTER network site in Bonanza Creek Experimental Forest in Interior Alaska. The data contains 3197 observations of snowshoe hares on a variety of parameters, collected between 1999 and 2012. Following an exploratory data visualization, weights between male and female snowshoe hares are examined by two-sample t-tests using a significance level (\\(\\alpha\\)) of 0.05 throughout. Differences between groups are described by Cohen’s d effect size. The relationship between weight and hind foot length is explored using a simple linear regression. All analyses are in R version 4.0.2 using RStudio version 1.3.1056.\nExploratory Findings\nAnnual juvenile hare trap counts\nFrom Figure 1 it appears that the observations of juvenile snowshoe hare trap counts have declined between 1999 and 2012. The maximum juvenile snowshoe hare trap count was 167 in 1999 and the minimum juvenile hare trap counts are 0 in 2002 and 2009. The mean and median counts across the study period are 27 and 16 (rounded from 15.5), respectively. Without a deeper understanding of the frequency of the trap counts it appears that juvenile snowshoe hare counts have decreased fairly substantially between 1999 and 2012. It appears that there was some inconsistency across the number of days per year where researchers counted juvenile hares. To overcome this inconsistency, I would suggest determining a set length of days to make observations (i.e. 15 days per year) during the same period of time in order to get more consistent sampling.\nFIGURE 1: Graph of the total number of juvenile snowshoe hares trapped and counted across the three monitoring sites annually between 1999-2012. Data: Kielland et al.(2017).Visualize juvenile hare weights\nDistributions of hare weights by sex across the three monitoring sites are relatively normally distributed between 1999 and 2012 in Figure 2. We can see that juvenile hares tended to be counted at the highest rate at the Bonanza Riparian monitoring site. There are a few instances where hare sex was undetermined, but weight was specified. In order to avoid impacting the male and female data, undetermined values are left as “NA”.\nFIGURE 2: Weight (in grams) for snowshoe hares by sex across the three monitoring sites (Bonanza, Bonanza Mature and Bonanza Riparian) during the study period from 1999-2012. Gold (female), teal (male), and light green (NA) points indicate observations of hare weights by sex and monitoring site across the juvenile hare population. NA values correspond to weight values where sex could not be determined. Box endpoints indicate the 25th and 75th percentile values; the black line and black point within each box indicates median and mean value for each hare by site, respectively. (Data: Kielland et al., 2017).Juvenile weight comparison (male and female snowshoe hares)\nTable 1 Descriptive statistics (mean, median, standard deviation, and sample size) between female and male snowshoe hares. Data: Kielland et al. 2017.\n\n\n\n\n\nSex\n\n\nMean weight (gm)\n\n\nMedian weight (gm)\n\n\nStandard deviation (gm)\n\n\nSample size\n\n\nfemale\n\n\n855.3909\n\n\n825\n\n\n292.2526\n\n\n197\n\n\nmale\n\n\n945.8589\n\n\n990\n\n\n333.2151\n\n\n163\n\n\n\n\n\nJuvenile snowshoe hare weights (gm) were compared between the two sexes; monitoring site was not included as a variable here, but it would be interesting to consider how weight characteristics differ across each site. On average, juvenile male hares weighed the most (945.8588957 \\(\\pm\\) 333.2150693 grams, n = 163; mean \\(\\pm\\) 1 standard deviation), compared to female hares (855.3908629 \\(\\pm\\) 292.2525894 grams, n = 197; mean \\(\\pm\\) 1 standard deviation)(Table 1). While the absolute difference in means is 90.47 grams (a 10.05% difference), the difference in means is significant (Welch’s two-sample t-test: t(325.02) = 2.71, p = 0.007093279), and the effect size is large (Cohen’s d = 0.29).\nRelationship between juvenile weight and hind foot length\nAs a starting point, the relationship between weight and hind foot length was explored (ignoring sex and monitoring site). A further analysis should be conducted to compare the relationship between weight and hind foot length between male and female hares, and should include monitoring site as an additional variable.\nThe relationship between weight and hind foot length appears fairly linear in Figure 3. A simple linear regression was used to explore the relationship between snowshoe hare weight (gm) and hind foot length (mm) across the snowshoe hares including all three monitoring sites, and includes both male and female snowshoe hares. The simple linear regression revealed that hind foot length moderately predicts hare weight (p < 0.001, R2 = 0.3 with an average slope of \\(\\beta\\) = 9.52g mm-1 (i.e. for each one millimeter increase in hind foot length we expect an average increase of hare weight of 9.52 g). Hind foot length and weight have a medium positive correlation (Pearson’s r = 0.55, p < 0.001). We can see from the results that the residuals are heteroscedastic.\nFIGURE 3: Relationship between weight (gm) and hind foot length (mm) for snowshoe hares (includes all monitoring sites). Points indicate snowshoe hare weight measurements(female hares = gold circles; male hares = teal triangles). Linear model summary: β1 = 9.52 g mm-1, p < 0.001, R2 = 0.3, Pearson’s r = 0.55), (Data: Kielland et al., 2017).Summary\nExploratory data analysis reveals the following initial findings:\nJuvenile male snowshoe hares are typically larger than female hares in both mean weight (gm) and hind foot length (mm)\nHind foot length appears linearly related with weight across both snowshoe hare sexes; the relationship (by simple linear regression) is significant, with a slope (expected average increase in weight with a 1 mm increase in hind foot length) of 9.52 g mm-1.\nCitation\nKielland, K., F.S. Chapin, R.W. Ruess, and Bonanza Creek LTER. 2017. Snowshoe hare physical data in Bonanza Creek Experimental Forest: 1999-Present ver 22. Environmental Data Initiative. https://doi.org/10.6073/pasta/03dce4856d79b91557d8e6ce2cbcdc14 (Accessed 2020-11-15).\n\n\n\n",
    "preview": {},
    "last_modified": "2022-02-25T09:03:32-08:00",
    "input_file": {}
  }
]
